@skyreginag this also applies to `qualified_arn`, `qualified_invoke_arn` and `version`. Unfortunately removing those from the `lifecycle.ignore_changes` leads to in-place-updates if the function has been updated externally which is worse in my opinion. 

Not sure if I can change something in the module to ignore lifecycle changes and prevent the redundant warnings.

```
  # module.lambda.aws_lambda_function.lambda_external_lifecycle[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda_external_lifecycle" {
        id                             = "s3-deployment"
      ~ last_modified                  = "2023-02-24T08:11:12.892+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-1:12345678:function:s3-deployment:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:12345678:function:s3-deployment:2/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

```